import React from "react";

function CashRegApp(){
    return (
        <div>
            <h1>-תוכנת קופה-</h1>
            <h2 id="cash">קופה לא עולה</h2>
            <p>נפתח TASK MANAGER ונראה אם PRIORIPOS GUI פתוח - אם כן נסגור</p>
            <p>נראה אם SUPPORT.EXE או RS232MANAGER פתוחים - אם כן נסגור</p>
            <p>נבדוק אם הסרוויס למטה - אם כן נבצע אתחול</p>
            <p>אם מתקבלת שגיאה - נבדוק האם קובץ קונפיגרציה ריק</p>
            <p>אם ריק נמחוק אותו ונחליף את הסיומת של קובץ הגיבוי</p>
            <p>אם אין קובץ גיבוי בתיקייה ניקח מתיקיית הגיבוי</p>
            <p className="short">
                נבדוק אם קובץ CLINET ב-SQL נפוח מדי - אם כן נצמצם ע"י הרצת סקריפט
                DELETENONALLACTIVEITEMS >
            </p>
            <p>נבדוק אם יש שגיאות ב-SQL STUDIO > אם כן נריץ סקריפט SUSPECT בהתאם</p>
            <p>נבדוק קובץ private במיקום: C:\Program Files\edea\PrioriPOS Service</p>
            <p>נבדוק שיש מספיק נפח בדיסק </p>
            <p>ניתן לבצע פריסה מחדש לגרסה </p>
            <p>אם הכל לא עובד - נעביר לסיסטם לבדיקה</p>
            <h2 id="view">הגדלת תצוגה בקופה</h2>
            <p><b>אם נעלמו הלחצנים בסרגל למעלה בקופה, יש ללחוץ על:</b></p>
            <p><b> Crtl+Alt+Shift+F</b></p>
            <h4>יציאה ממסך מלא VNC</h4>
            <p><b>CTRL ALT SHIFT F </b></p>
            <h2 id="nom">נומרטורים</h2>
            <p>יש להיכנס לכונן C</p>
            <p>Priopos</p>
            <p>קובץ Posntities backup(777).xml ולשנות את שמו לפני סיומת ה- XML </p>
            <p>יש להעלות קופה ולוודא תקינות</p>
            <p>
                אם לא עבד, ניתן למחוק את הקובץ כולו (יווצר אחד חדש בהמשך) ולהיכנס לקופה
            </p>
            <h2 id="allow">שינוי קופה לדיווח נוכחות</h2>
            <p>
                בהגדרה רק קופה אחת יכולה להיות אחראית על דיווח נוכחות (לפי הגדרות הרשת /
                הלקוח)
            </p>
            <p>להיכנס לקובץ קונפיגורציה של הקופה – CashRegister </p>
            <p>לחפש בקובץ (crtl f) allowtoreporttime ולשנות true—false</p>
            <h2 id="pass">גיפט לא עובר</h2>
            <p>כאשר קופה X לא מקבלת גיפט דוגמת פרקסל/מולטיפס/DTS/Cross Pay </p>
            <p>כרטיסים כן עוברים בקופות אחרות בסניף</p>
            <p className="short">
                יש להעביר את קבצי הגיפט מקופה אשר מקבלת גיפטים לקופה בה הגיפט לא עובר
                (בתנאי שהקופות שייכות לאותה רשת)
            </p>
            <p>יש להיכנס בקופה להעברת קבצים</p>
            <p>כונן C</p>
            <p>PrioPos </p>
            <p>תיקייה רלוונטית לפי הגיפט, לדוגמה: CrossPay</p>
            <p>להעביר את הקובץ</p>
            <p>לוודא העברת גיפט תקינה</p>
            <h4>גיפט חסר</h4>
            <p><b>אחד ממנפיקי הגיפט חסר, מה צריך לעשות?</b></p>
            <p className="short">
                יש לבדוק בפריורטי במסך אמצעי תשלום שספק הוגדר (ניתן לראות תמונה
                מהפריורטי בתצוגה מלאה F5)
            </p>
            <h2 id="sale">שגיאה בסיום עסקה</h2>
            <p>
                במידה והקופה ביקשה קוד טכנאי, יש להזין (לא למסור ללקוח) ולפתור תקלה.
            </p>
            <p className="short">
                במידה והקופה נתקעה, בוצעה בדיקת במסך עסקאות, אין "וי" ואנו מבינים כי
                עסקאות לא עברו לשרת
            </p>
            <p>בדיקה של מקום בדיסק (כונן C)</p>
            <p>אתחול סרוויס קופה</p>
            <p>כניסה לתוכנת קופה </p>
            <p>לבדוק האם העסקה נשמרה ועלתה לשרת (האם יש V במסך עסקאות)</p>
            <label htmlFor="">עסקה לא נשמרה? </label>
            <ol>
                <li>להעביר למנהל תמיכה ע"פ פורמט העברת קריאות שירות</li>
                <li>
                    להנחות את הלקוחה לבצע את העסקה בשנית ולהפנות למשרדים לזיכוי החיוב
                    הכפול
                </li>
            </ol>
            <h2 id="down">מסך הפוך</h2>
            <p>יש להדריך את הלקוח ללחוץ על: Crtl + Alt+ חץ למעלה</p>
            <h2 id="file">שיתוף קבצים בין קופות</h2>
            <p>
                בקופת הלקוח, כדי להגיע לתיקיית הקבצים של קופה אחרת, יש להיכנס ל—רשת
                במחשב
            </p>
            <p>ולכתוב: \\192.168.100.115\c$ </p>
            <h2 id="send">שידור עסקאות ידני</h2>
            <label htmlFor=""><b>תוכנת קופה</b></label>
            <ol>
                <li>פעולות טכנאי</li>
                <li>הזנת קוד</li>
                <li>עסקאות שלא שודרו</li>
            </ol>
            <img src="send.png" alt=""/>
            <h2 id="log">הוצאת לוגים</h2>
            <h4>לוג קופה</h4>
            <p className="short">
                כדי להוציא קובץ zip, יש ללחוץ פעמיים על שם הסניף והעמדה – להסתכל
                בתמונה:
            </p>
            <p><b>הגדרות:</b></p>
            <p>
                <b>Log txt</b> – לוג קופה מכיל את כל הפעולות אשר בוצעו באפליקציית קופה,
                שגיאת משתמש מה שהלקוח ראה ומה קשור לבעי
            </p>
            <p><b>דיספטצ'ר</b> – סנכרון יוצא מהקופה (מה חסר בעסקה, שגיאות)</p>
            <p><b>Service log</b> – סנכרון נכנס</p>
            <p>כדי להעביר לוגים לבק אופיס, יש לשמור את הנתיב ב:</p>
            <p>כונן L, תיקיית לקוח, לפתוח תיקיה חדשה עם מספר קריאה</p>
            <p>להעביר לוגים ע"י לחיצה על החץ בכיוון הרלוונטי</p>
            <h4>לוג API</h4>
            <p><b>כיצד להוציא לוגים?</b></p>
            <p>כניסה לשרת API</p>
            <p>כניסה לתיקית C:\inetpub\wwwroot</p>
            <p>כניסה לנקודת קצה רלוונטית (בדר"כ edearetailapi)</p>
            <p><b>2 אופציות ללוגים:</b></p>
            <p>לוג פתוח - קיים בתיקייה הראשית לוג של היום וקיימת תיקיית לוגים</p>
            <p>לוג סגור – </p>
            <p>יש להיכנס לWWWROOT וללחוץ קליק ימני על התיקיה הרלוונטית </p>
            <p>להיכנס properties </p>
            <p>טאב של SECURITY</p>
            <p>יש ללחוץ על עריכה בהרשאות ולבחור בiisusers</p>
            <p>בחלק התחתון של המסך לסמן דגל על WRITE ולשמור את השינויים.</p>
            <p>
                הלוג יתחיל להיכתב במידה וצריך יש לשחזר או להשאיר פתוח ל-10 דקות ולסגור
            </p>
            <img src="API.PNG" alt=""/>
            <h4>לוג מבצעים</h4>
            <p>נכנסים לתיקיית Prioripos</p>
            <p>מחפשים את קובץ Loggin.xml ופותחים אותו עם Notepad</p>
            <p>לחפש SALES</p>
            <p>יש 3 שורות עם המילה SALE שמוגדרות כ- ERROR</p>
            <p>בשורות אלו, יש לשנות את המילה ERROR ל-ALL</p>
            <p>לשמור את הקובץ ולצאת מהתיקייה</p>
            <p>יש להיכנס לתוכנת קופה, לשחזר את התקלה (על מנת שיווצר הלוג)</p>
            <p>נסגור את תוכנת הקופה</p>
            <p>
                ניכנס לקובץ loggin.xml ולשנות בחזרה את השורות עם המילה ALL בחזרה
                ל-ERROR
            </p>
            <p>יוצר לוגים (ע"י לחיצה דאבל קליק על סניף וקופה)</p>
            <p>הקובץ של לוג המבצעים נשמר בתיקיית לוגים (כונן L)</p>
            <p>יש לשמור את הנתיב ולהעביר לטיפול המשך</p>
            <p className="war">יש לסגור את הלוג לאחר וידוא שהוא נשמר</p>
            <img src="dislog.PNG" alt=""/>
            <h2 id="dump">dump</h2>
            <h4>כיצד למשוך קובץ Dump?</h4>
            <p>כאשר הקופה רצה ברקע, בקופה מצד ימין למטה יש אייקון אדום</p>
            <p>יש להקיש על אייקון זה מקש ימני</p>
            <p>הכן חבילת Dump</p>
            <p>בגמר ההכנה, הקובץ יועבר לתיקיית debugging</p>
            <p>נתיב לקובץ: C:\debugging</p>
            <p>בתוך תיקיה זו נוצרת תיקיה בשם hang_mode </p>
            <p>בתוך תיקיה זו יש קובץ ZIP עם אותו השם hang_mode </p>
            <p>זהו הקובץ אשר צריך למשוך</p>
            <p className="war">**במידה ואין אפשרות ליצור קובץ DUMP יש להעביר לסיסטם</p>
            <img src="dump.PNG" alt=""/>
            <h2 id="conf">קבצי קונפיגורציה</h2>
            <h4>קובץ Private</h4>
            <p><b>קובץ זה משפיע על סנכרון הקופה ופעולותיה אל מול השרת</b></p>
            <p>יש תיקיה ייעודית במיקום: C:\Program Files\edea\PrioriPOS Service</p>
            <p><b>פיתרון לתקלות:</b></p>
            <p>
                במידה וקובץ private ריק יש לנסות את הגיבוי שמתחתיו, ולמחוק את סיומת BAK

            </p>
            <p>
                במידה וקובץ הגיבוי ריק, יש לחלץ מ-ZIP של הסרוויס בתיקיית PRIORIPOS
                BACKUPS
            </p>
            <p>במידה ואין ניתן לקחת מקופה אחרת.</p>
            <img src="ptivet.PNG" alt=""/>
            <h4>cash configuration</h4>
            <p>במידה וקובץ קונפיגורציה ריק, יש לקחת קובץ קונפיגורציה גיבוי BAK</p>
            <p>במידה הוא ריק, יש לקחת מ-DB Backup, נתיב: C:\db_backup</p>
            <p>לפתוח קובץ Win.RAR</p>
            <p>PrioriPOS</p>
            <p>CashRegister – להעתיק קובץ זה לאותו מיקום בקופה הרלוונטית</p>
            <p><b>מספר גרסה - WCFV </b></p>
            <p>>WCFVirtualDirectory>POSServices2.4.1.0>/WCFVirtualDirectory></p>
            <p><b>יש לוודא מספר גרסה מקורי במיקום:</b></p>
            <p>קובץ version בכונן c </p>
            <p>נתיב:C:\PrioriPOS</p>
            <p><b>Branchcode = סניף </b></p>
            <p>יש לוודא מספר סניף תקין ב:</p>
            <p>פריורטי>מסך סטטוס עמדות מכירה</p>
            <p>תוכנת קופה (למעלה מימין)</p>
            <p><b>Allow to report time</b></p>
            <p>לשנות מ-True ל-False </p>
            <p>יש לוודא תקינות ב- תוכנת קופה (לחצנים למעלה)</p>
            <p><b>מספר קופה - PointOfsale </b></p>
            <p><b>מסופון - לחפש external</b></p>
            <p>(רק אם זה וריפון)</p>
            <p className="short">
                לוודא COM בתוכנה הרלוונטית ולשנות בהתאם בקובץ לדוגמה: חיפשנו COM בתוכנה
                ומצאנו COM2, בהתאם לכך נשנה בקובץ קונפיגורציה
            </p>
            <p>
                <b>Company Name</b> – יש לחפש שם זה על מנת לוודא שהלקוח מוגדר נכון
                בקובץ
            </p>
            <p>ניתן לוודא מול קופה אחרת (באותו סניף / סניף שונה)</p>
            <h2 id="up">שדרוג גרסה</h2>
            <p>יש לבדוק ב-Priority Client </p>
            <p>מסך סניפים</p>
            <img src="up.PNG" alt=""/>
            <h4>גרסה ירדה מן השרת</h4>
            <p>ראשית יש להוריד Service למטה</p>
            <p>להעתיק את תיקיית PrioPos (לצורך גיבוי)</p>
            <p>למחוק את כל תוכן התיקיה מלבד קובץ קונפיגורציה</p>
            <p>למחוק את תוכן תיקיית PrioPOS Service</p>
            <p>בתיקיית PrioPOS Downloads יש לפרוס (Extract to):</p>
            <p>תיקיית Client.GUI, תיקיית PrioPOS Service</p>
            <p>לאחר הפריסה תיקיית Downloads אמורה להיות ריקה</p>
            <p>להדביק קבצי סרוויס במיקום:</p>
            <p>C:\Program Files\edea\Prioripos Service</p>
            <p>להדביק קבצי GUI במיקום:</p>
            <p>C:\Prioripos</p>
            <p>לשדרג גרסת קופה בקובץ קונפיגורציה - WCFV</p>
            <p>להעלות סרוויסים למעלה, להעלות תוכנת קופה – וידוא תקינות </p>
            <img src="extract.PNG" alt=""/>
            <h4>גרסה לא הורדה מהשרת</h4>
            <img src="upgrade.PNG" alt=""/>
            <p>
                <b>ראשית יש להעתיק את קבצי הגרסה הרלוונטית סרוויס + GUI מתיקיית:</b>
            </p>
            <p>f:\development\products\prioripos\versions\2.X.X.X</p>
            <p>ראשית יש להוריד Service למטה</p>
            <p>להעתיק את תיקיית PrioPos (לצורך גיבוי)</p>
            <p>למחוק את כל התיקיה מלבד קובץ קונפיגורציה</p>
            <p>למחוק את תוכן תיקיית PrioPOS Service</p>
            <p>בתיקיית PrioPOS Downloads יש לפרוס (Extract to):</p>
            <p>תיקיית Client.GUI, תיקיית PrioPOS Service</p>
            <p>לאחר הפריסה תיקיית Downloads אמורה להיות ריקה</p>
            <p>להדביק קבצי סרוויס במיקום:</p>
            <p><b>C:\Program Files\edea\Prioripos Service</b></p>
            <p>להדביק קבצי GUI במיקום:</p>
            <p><b>C:\Prioripos</b></p>
            <p>לשדרג גרסת קופה בקובץ קונפיגורציה - WCFV</p>
            <p>להעלות סרוויסים למעלה, להעלות תוכנת קופה – וידוא תקינות </p>
            <h2 id="back">נסיון להחזיר פריט</h2>
            <p><b>תקלה:</b> SC22051569 – ניסיון לבצע החזר חלקי בקופה,</p>
            <p>
                <b>פיתרון:</b> לא היה צריך לסמן דגל "החזר הכול", היה צריך לכתוב כמות
                מוחזרת (מסומן בריבוע אדום)
            </p>
            <img src="return.PNG" alt=""/>
            <h2 id="no">לא יורד שורה אוטומטית</h2>
            <p>
                <b>תקלה:</b> SC22051891 – שורות בקופה לא יורדות באופן אוטומטי, קלט
                קטן/גדול מדי
            </p>
            <p>
                <b>פיתרון:</b> מדובר על הגדרות בפריוריטי, מסומן דגל "מעבר לשדה מוכרן"
                נתיב בפריורטי: סניפים -> עמדות מכירה לסניף, עמדה 2
            </p>
            <img src="row.PNG" alt=""/>
            <h2 id="stat">סטטוס עמדות מכירה</h2>
            <img src="stat.PNG" alt=""/>
            <h2 id="branch">סניפים</h2>
            <img src="branch.PNG" alt=""/>
            <h2 id="cancel">ביטול טעינת גיפטקארד</h2>
            <p className="war">
                במידה והמוכרן כבר הטעין את הגיפט, אך הלקוח התחרט ואינו מעוניין לשלם, יש
                לבדוק את סוג הגיפטקארד ולאחר מכן:
            </p>
            <p className="war">כרטיס אשראי – לשלם עבור טעינה עם אותו כרטיס</p>
            <p className="war">מולטיפאס / פרקסל / כרטיס פרי-פייד – למחוק אמצעי תשלום</p>
        </div>
    );
}

export default CashRegApp;