import React from "react";

function Communication(){
    return (<div>
        <h1>-תקשורת-</h1>
        <h2 id="image">תמונות שלא עברו</h2>
        <p>?האם מוגדר במסך קבועי עמדות מכירה</p>
        <p>
            תחת הקבוע: "ספריית תמונות" - יש להגדיר את נתיב התיקייה של התמונות בשרת
            IIS .יש לוודא כי התיקייה פתוחה לכל המשתמשים.
        </p>
        <p>?מה שם התמונה</p>
        <p>
            במסך כרטיס פריט: בשדה "תמונה" יש למלא את שם קובץ התמונה כולל הפורמט של
            התמונה - ניתן לבחור תמונות בפורמט jpg שגודלן עד 500 ק"ב, יש לשים לב כי
            נתיב
        </p>
        <p>התמונה לא מכיל אותיות בעברית, דוגמה לשם תמונה: jpg.911001 </p>
        <p>יש לוודא כי תאריך קובץ התמונה תואם לתאריך הנוכחי </p>
        <p>יש לסמן את הדגל "העברת תמונה"</p>
        <p>?האם התמונות נמצאות בתיקיה הרלוונטית בשרת IIS</p>
        <p>?האם התמונות נמצאות בקופות בתיקיה prioripos images</p>

        <p>יש קובץ PDF במסמכים ב-Share Point, ניתן לשלוח ללקוח להסבר המלא</p>
        <h2 id="reciept">קבלה ירוקה</h2>
        <img src="greenReciept.PNG" alt=""/>
        <p>
            <b>Pairzon</b> – חברה ישראלית פרטית שמייצרת פלטפורמה להנפיק חשבונית
            ירוקה
        </p>
        <p>כתובות IP לבדיקת טלנט:</p>
        <ol>
            <li>כתובת מספרית: 51.105.111.243 בפורט 80</li>
            <li>כתובת DNS: edea.pairzon.com בפורט 80 </li>
        </ol>
        <p>
            <b>Weezmo</b> – פלטפורמה גלובלית להפעלת קמעונאות שמציעה פיתרון לקבלה
            מקומית של תשלום ללא מזומן, חבילת ניהול תוכנה וכלי מעורבות לצרכנים.
        </p>
        <p>תקלה – חשבונית אינה נשלחת, אפשר לשלוח telnet לכתובות:</p>
        <ol>
            <li>75.2.29.209 80 </li>
            <li>80 Api.weezmo.com</li>
        </ol>
        <p>
            במידה ויש טלנט לכתובת המספרית אך לא לשמית - יש לבדוק DNS או להחליף קובץ
            HOSTS ולבדוק שנית (נתיב לקובץ: C:\Windows\System32\drivers\etc
        </p>
        <h2 id="iis">אתחול IIS</h2>
        <p><b>אתחול לשרת זה נובע מתקלת סנכרון רשתית – בעקבות:</b></p>
        <ol>
            <li>מס' גרסה באדום</li>
            <li>אין אפשרות לשלוף מידע מהשרת</li>
            <li>תקשורת עם השרת נכשלה </li>
        </ol>
        <p><b>כיצד לאתחל אותו? </b></p>
        <ol>
            <li>
                וידוא כתובת IP של שרת IIS POS - יש להשוות כתובת IP בפריורטי מול כתובת
                בקובץ קונפיגורציה ע"י חיפוש WCFV
            </li>
            <li>
                בתוך השרת כדי לאתחל אותו – יש לחפש IIS או להיכנס דרך Task Manager
            </li>
            <li>תוכנת IIS – Internet Information Services</li>
            <li>רכיבי Application Tools – לוודא שתהליכים בסטטוס Started </li>
        </ol>
        <img src="iisA.PNG" alt="iis"/>
        <h4>סגירת תהליכי W3WP</h4>
        <p>ניכנס ל-Default Websites </p>
        <p>יש לעשות Stop ל-Default Website</p>
        <p>ניכנס ב-Task Manager ל-Details</p>
        <p>נסגור את תהליכי W3WP – ללא סגירתם, אתחול השירות לא יהיה אפקטיבי</p>
        <img src="iisB.PNG" alt="iis"/>
        <h4>אתחול סרוויס IIS POS</h4>
        <p>נחזור ל-Default Websites </p>
        <p>לעשות Start ל- Default Websiteמחדש</p>
        <img src="iisC.PNG" alt="iis"/>
        <h2 id="connect">אין חיבור לסניף</h2>
        <p>כאשר אין אפשרות להתחבר לסניף</p>
        <p>יש לבדוק אם בסניף יש תקשורת והקופה עובדת</p>
        <p>במידה ויש תקשורת ועדיין אין אפשרות להתחבר</p>
        <p>במידה ויש עוד קופות בסניף, יש לבדוק אם החיבור שלהן תקין</p>
        <p>יש לוודא חיבורים של הראוטר / Switch</p>
        <p>יש לשלוח פינג לכתובת הסניף</p>
        <p>
            יש לבדוק אם לא שינו את כתובת ה-IP בפריוריטי > סטטוס עמדות מכירה > עמדה
            רלוונטית
        </p>
        <p>
            יש לבדוק האם שירות VNC פועל > אם לא יש להנחות את הלקוח/ה רק להיכנס
            לאפליקציה בקופה עצמה
        </p>
        <p> FIREWALL במידה ולא תקין יש לבדוק את הגדרות </p>
        <img src="firewall.PNG" alt="firewall"/>
        <h2 id="ip">הגדרת כתובת IP</h2>
        <p>
            אם לא מצליחים להתחבר, להנחות את הלקוח לחפש בשדה החיפוש בתחתית המסך
            NCPA.CPL כדי לבדוק כרטיס רשת.
        </p>
        <p>יש להיכנס ל-Ethernet </p>
        <p>מקש ימני</p>
        <p>מאפיינים</p>
        <p>בחירה ב-Internet Protocol Version 4 (סימון ב-V) </p>
        <p>מאפיינים</p>
        <img src="ipB.PNG" alt="ip"/>
        <img src="ipA.PNG" alt="ip"/>
        <p>יש לוודא שהלקוח על אפשרות שנייה – Use the following ip address:</p>
        <p>להגדיר את כתובת ה-IP הרלוונטית או לוודא שכתובת IP מוזנת.</p>
        <label htmlFor="">הזנת כתובת IP:</label>
        <ol>
            <li>יש להזין כתובת IP ע"פ ה-Priority</li>
            <li>יש להזין Default Gateway </li>
        </ol>
        <label htmlFor="">במידה וכתובת IP מוזנת:</label>
        <ol>
            <li>
                להנחות את הלקוח לעשות אצלו ב-CMD ipconfig כדי לוודא את כתובת IP של
                המחשב שהיא מוגדרת כמו שצריך
            </li>
        </ol>
        <p>יש ללחוץ בסוף על OK על מנת לשמור את ההגדרה החדשה</p>
        <p>לצאת ולוודא התחברות תקינה לכתובת IP החדשה</p>
        <img src="ipC.PNG" alt="ip"/>
    </div>);
}

export default Communication;